Revit 2026 API

# ExternalGeometryId Properties

---

The ExternalGeometryId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | External geometry identifier. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ExternalGeometryId Class

Autodesk.Revit.DB Namespace